<?php

return [
    'error'  => 'یک خطای داخلی رخ داده است.',
    'models' => [
        'user'                => 'کاربر',
        'role'                => 'نقش',
        'permission '         => 'مجوزهای نقش',
    ],
    'delete' => [
        'failed'       => 'خطا در حذف :model',
        'has_relation' => 'امکان حذف :model به دلیل وجود اطلاعات مرتبط نمی‌باشد.',
        'success'      => 'حذف :model با موفقیت انجام شد.',
    ],
    'csv' => [
        'error' => 'خطا در ایجاد فایل اکسل'
    ],
    'create' => [
        'failed'  => 'خطا در ایجاد :model',
        'success' => ':model با موفقیت ایجاد شد.',
    ],
    'update' => [
        'failed'  => 'خطا در بروزرسانی :model',
        'success' => ':model با موفقیت بروزرسانی شد.',
    ],
    'user' => [
        'delete' => [
            'failed'       => 'خطا در حذف کاربر',
            'has_relation' => 'امکان حذف کاربر به دلیل وجود اطلاعات مرتبط نمی‌باشد.',
            'success'      => 'حذف کاربر با موفقیت انجام شد.',
        ],
        'restore' => [
            'success' => 'کاربر با موفقیت بازیابی شد.'
        ],
        'profile' => [
            'update' => [
                'success' => 'پروفایل شما با موفقیت ویرایش شد.'
            ]
        ]
    ],
];
